In [47]:
# Import dependecies

import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression

In [3]:
df = pd.read_excel('../Resources/tracks_tavern_sales_data.xlsx')
df.head()

,item,item_code,quantity,unit_price,total_sales_amount,date,type
0,pint spotted cow,3140,64.0,3.937500,252.00,2021-01-08,beer
1,dbl rail vodka,3455,37.0,4.945946,183.00,2021-01-08,vodka
2,bottle miller high life,3122,31.0,3.250000,100.75,2021-01-08,beer
3,pint stein,3141,29.0,3.517241,102.00,2021-01-08,beer
4,shot seagrams vo,3325,26.0,2.423077,63.00,2021-01-08,scotch/whiskey

In [31]:
df.dtypes

item                   object
item_code               int64
quantity              float64
unit_price            float64
total_sales_amount    float64
date                   object
type                   object
dtype: object

In [23]:
burger_df = df.loc[df['type'] == 'burger']
burger_df.head()

,item,item_code,quantity,unit_price,total_sales_amount,date,type
14,riverwest burger,2714,16.0,11.093750,177.50,2021-01-08,burger
18,all american burger,2840,13.0,7.403846,96.25,2021-01-08,burger
24,cheese burger,2841,11.0,8.136364,89.50,2021-01-08,burger
41,tracks big boy,3704,7.0,10.142857,71.00,2021-01-08,burger
123,thurs burger,2886,1.0,3.000000,3.00,2021-01-08,burger

In [7]:
burger_df.dtypes

item                   object
item_code               int64
quantity              float64
unit_price            float64
total_sales_amount    float64
date                   object
type                   object
dtype: object

In [8]:
burger_df['date'] = pd.to_datetime(burger_df['date'])
burger_df.dtypes

C:\Users\George\anaconda3\envs\mlenv\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

item                          object
item_code                      int64
quantity                     float64
unit_price                   float64
total_sales_amount           float64
date                  datetime64[ns]
type                          object
dtype: object

In [12]:
burger_weekly_sales = burger_df.groupby(['date']).sum(['quantity', 'total_sales_amount'])
burger_weekly_sales.drop(['item_code', 'unit_price'], inplace=True, axis=1)
burger_weekly_sales.head()

            quantity  total_sales_amount
date
2019-02-15      40.0              307.00
2019-02-22      87.0              697.25
2019-03-01      82.0              599.25
2019-03-08      92.0              742.00
2019-03-15      77.0              604.75

In [13]:
burger_weekly_sales.rename(columns={'quantity': 'burger_qty', 'total_sales_amount':'burger_sales'}, inplace=True)

In [24]:
burger_weekly_sales.burger_sales.sum()

77861.82999999999

In [18]:
df.type.value_counts()

beer               3926
vodka              2790
scotch/whiskey     2034
nonalcoholic       1848
side               1812
appetizers         1061
special            1042
fish                997
tequila             865
liqueur             845
sandwich            776
cocktail            749
burger              734
rum                 691
bourbon             546
gin                 527
hard seltzer        472
brandy              440
breakfast           335
salad               331
wine                246
hard cider          241
happy hour          166
other               162
entree               69
specialty shots      63
Name: type, dtype: int64

In [25]:
# Food item rows entree, other, salad, breakfast, burger, sandwich, fish, side
drop_rows = [ 'entree', 'other', 'salad', 'breakfast', 'burger', 'sandwich', 'fish', 'side']
liquor_sales = df.query('type not in @drop_rows')
liquor_sales.head()

,item,item_code,quantity,unit_price,total_sales_amount,date,type
0,pint spotted cow,3140,64.0,3.937500,252.00,2021-01-08,beer
1,dbl rail vodka,3455,37.0,4.945946,183.00,2021-01-08,vodka
2,bottle miller high life,3122,31.0,3.250000,100.75,2021-01-08,beer
3,pint stein,3141,29.0,3.517241,102.00,2021-01-08,beer
4,shot seagrams vo,3325,26.0,2.423077,63.00,2021-01-08,scotch/whiskey

In [27]:
liquor_sales.type.value_counts()

beer               3926
vodka              2790
scotch/whiskey     2034
nonalcoholic       1848
appetizers         1061
special            1042
tequila             865
liqueur             845
cocktail            749
rum                 691
bourbon             546
gin                 527
hard seltzer        472
brandy              440
wine                246
hard cider          241
happy hour          166
specialty shots      63
Name: type, dtype: int64

In [32]:
liquor_sales['date'] = pd.to_datetime(liquor_sales['date'])
liquor_sales.dtypes

C:\Users\George\anaconda3\envs\mlenv\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

item                          object
item_code                      int64
quantity                     float64
unit_price                   float64
total_sales_amount           float64
date                  datetime64[ns]
type                          object
dtype: object

In [33]:
liquor_weekly_sales = liquor_sales.groupby(['date']).sum(['quantity', 'total_sales_amount'])
liquor_weekly_sales.drop(['item_code', 'unit_price'], inplace=True, axis=1)
liquor_weekly_sales.head()

            quantity  total_sales_amount
date
2019-02-15     650.0             2733.25
2019-02-22    1533.0             7104.10
2019-03-01    1744.0             7611.00
2019-03-08    1765.0             7906.75
2019-03-15    1819.0             8122.50

In [34]:
liquor_weekly_sales.rename(columns={'quantity': 'liquor_qty', 'total_sales_amount':'liquor_sales'}, inplace=True)
liquor_weekly_sales.head()

            liquor_qty  liquor_sales
date
2019-02-15       650.0       2733.25
2019-02-22      1533.0       7104.10
2019-03-01      1744.0       7611.00
2019-03-08      1765.0       7906.75
2019-03-15      1819.0       8122.50

In [37]:
# Join liquor weekly sales and burger weekly sales

logistic_df = liquor_weekly_sales.join(burger_weekly_sales, how='left')
logistic_df.head()

            liquor_qty  liquor_sales  burger_qty  burger_sales
date
2019-02-15       650.0       2733.25        40.0        307.00
2019-02-22      1533.0       7104.10        87.0        697.25
2019-03-01      1744.0       7611.00        82.0        599.25
2019-03-08      1765.0       7906.75        92.0        742.00
2019-03-15      1819.0       8122.50        77.0        604.75

In [44]:
logistic_df.describe()

        liquor_qty  liquor_sales  burger_qty  burger_sales
count   129.000000    129.000000  128.000000    128.000000
mean   1748.023255   8225.492634   73.289062    608.295547
std     851.107719   4572.862037   42.894331    344.207412
min       8.000000     38.500000    2.000000     10.990000
25%     958.000000   3950.000000   36.250000    307.187500
50%    1834.000000   8330.250000   64.000000    550.065000
75%    2326.000000  10553.500000  103.000000    825.625000
max    3867.000000  22889.750000  196.000000   1616.250000

In [72]:
logistic_df = logistic_df.dropna()

In [73]:
logistic_df.liquor_sales.value_counts()

3950.00     1
16586.05    1
2608.25     1
2970.50     1
9460.00     1
           ..
7062.80     1
8370.80     1
7876.75     1
19029.85    1
12458.25    1
Name: liquor_sales, Length: 128, dtype: int64

In [74]:
logistic_df['target'] = np.where(logistic_df['burger_sales'] >= 550,1,0)

C:\Users\George\anaconda3\envs\mlenv\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [75]:
logistic_df.target.value_counts()

0    64
1    64
Name: target, dtype: int64

In [76]:
y = logistic_df['target']
X = logistic_df.drop(columns='target')

In [77]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,
   y, random_state=1, stratify=y)

In [78]:
y_train.shape

(96,)

In [79]:
from sklearn.linear_model import LogisticRegression
classifier = LogisticRegression(solver='lbfgs',
   max_iter=200,
   random_state=1)

In [80]:
classifier.fit(X_train, y_train)

LogisticRegression(max_iter=200, random_state=1)

In [86]:
y_pred = classifier.predict(X_test)
y_pred

array([0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 1,
       0, 0, 1, 0, 1, 1, 0, 1, 1, 0])

In [83]:
from sklearn.metrics import accuracy_score
print(accuracy_score(y_test, y_pred))

1.0